---
layout: post
title: “쿠팡 할인 전자제품” 앱 개발후기 
comments: true
share: true
tags: [개발,모바일앱,쿠팡]
---
<p class="meta">2019년 11월 2일 - 용인</p>

“쿠팡 할인 전자제품” 앱 개발후기 

저녁때 고양이들 밥 주고 아내랑 책상에 나란히 앉아 책을 보거나 코딩을 하거나 게임을 하는 시간이 있다. (게임은 주로 내가 함) 그 시간에 그냥 “[쿠팡 할인 제품 보여주는 사이트](https://bumeee.com/)를 앱으로 볼 수 있게 하면 어떨까요?”라고 말한 게 시작이었다. 왜 진작 그 생각을 못했을까? 

마침 내 맥북을 완전히 지우고 새 OS를 설치한 터라 최신 안드로이드 개발툴을 설치해보고 싶은 마음도 있었다. 애플에서 최근에 발표한 SwiftUI를 써보겠다고 Xcode를 먼저 설치해놓긴 했지만 빠르게 만들어서 앱 심사 부담 없이 올리기엔 Google Play가 낫다고 생각했다. 

앱의 기능은 단순하다. 앱을 열면 쿠팡 전자제품 중에 최근 30일 평균 가격보다 낮은 가격에 파는 평점 4점 이상의 제품들을 보여주고 특정 제품 정보를 누르면 쿠팡 앱에서 그 제품을 보여주는 것이다. 막상 코드를 짜려고 하니 2016년에 채팅 앱을 올려보고 몇 년 만에 다시 안드로이드 개발을 해보는 거라 공부할 것들이 꽤 있었다. 앱을 올리고 나서 안드로이드O부터 추가된 어댑티브 아이콘이라는 개념을 알게 되어 다음날 아침에 부랴부랴 준비해서 올리기도 했다. 

데이터는 [bumee.com](https://bumeee.com/)에서 쓰는 firebase database를 그대로 쓰기로 했다. 그러니까 안드로이드 앱을 켜면 나오는 목록만 구현하고 올리면 되는 것이었다.  보통 퇴근 후, 아침에 일찍 일어나서 작업했는데 어떤 날은 많이 작업하고 어떤 날은 코드 딱 한 줄만 쓰기도 했다. 아무리 간단한 앱이라도 하루에 한 줄도 안 쓰면 포기할 수도 있다는 생각이 들어서 피곤해도 한 줄은 썼다.

아이콘은 구글 이미지 검색에서 라이센스 제한 없는 이미지를 하나 골라서 썼다. 이번 작업에서는 집 밖에서, 대중교통을 타고 이동 중일 때 구현한 부분을 잘게 쪼개 To Do 앱에 기록한 것이 생산성을 높여줬다. 설계를 생각하는 시간과 구현에 집중하는 시간이 나뉜다는 게 효율적이었다. 

앱을 올린 다음 며칠이 지나도 스토어에 올라오지 않았다. 찾아보니 구글도 세부적으로 심사하는 절차를 도입해서 앱을 자주 올리지 않거나 거절을 많이 당한 개발자 위주로 수동 심사 과정을 거친다고 한다. 앱은 결국 3일 만에 스토어에 올라왔고 아직 스토어에서 검색되진 않는다. 앞으로 이걸 확장해서 내가 쓸 앱들을 계속 올릴 생각이다. 

다 끝내고 나니 앱을 출시하는 것이 3년 전보다 더 쉬워졌다는 생각이 들었다. 간단한 아이디어라면 백엔드로 firebase를 쓰고 최신 안드로이드 개발환경에서 구현에만 집중해서 빠르게 앱을 만들 수 있다. 오랜만에 앱을 출시해보면서 번거로운 작업들로 인한 고통이 줄었다는 걸 확인했으니 앞으로 떠오르는 아이디어들을 여가시간에 계속 앱으로 찍어내야겠다. 지금은 개인이 인터넷으로 뭔가 시도해보기 아주 좋은 시절이다. 

쿠팡 할인 전자제품 앱 보러 가기: [https://play.google.com/store/apps/details?id=com.sungchi.bumee](https://play.google.com/store/apps/details?id=com.sungchi.bumee)
