---
layout: post
title: 뉴스 요약은 허상인가
comments: true
share: true
tags: [뉴스,AI]
---
머릿속에서 떠나지 않는 주제가 있어서 기록해 본다. 바로 뉴스 요약이 잡을 수 없는 신기루인지에 대한 이야기다. 매번 새로운 뉴스 읽기 도구를 사용해서 나에게 맞춰진 뉴스를 핵심만 더 빠르게 읽어보려고 시도하지만 결국 기존 뉴스 소스로 돌아가게 된다. 

내 취향을 입력하고 뉴스 요약을 해놓고 보면 좋은 재료를 다 갈아버린 것처럼 맛없는 요리가 되어버린다. 어떤 컨셉 아래 일관성 있게 정리를 해야 먹을만한 무언가가 되는 것이다. 일관성 있는 요약을 하려면 편향이 들어가야 하고 그건 사람이 숨 쉬듯이 쉽게 할 수 있는 작업이다. 

은은하지만 세밀한 편향이 중요하다. AI가 [이런 것도 해낼 것 같은 분위기](https://www.anthropic.com/research/claude-character)지만 지금은 인간만이 할 수 있는 일이다. 이런 요구사항에 잘 맞는 [슬로우레터](https://slownews.kr/slowletter_subscription)로 매일 아침을 시작하고 있다. 국내 중요한 뉴스를 일관성 있게 잘 요약해 주셔서 나의 시간을 많이 절약하고 있다. 이런 뉴스레터를 공짜로 보기 죄송해서 작은 후원금도 내고 있다. 

마음에 들지 않는 방향을 갖고 있더라도 이렇게 잘 편집된 뉴스레터라면 구독을 끊기보다 다른 편향을 가진 미디어를 구독해서 균형을 맞추는 것도 하나의 방법이다. 신경 쓰이는 점은 슬로우레터가 한 사람에게 의존하고 있다는 것이다. 지속 가능한 방법을 찾으면 좋겠다. 그게 AI가 될지는 모르겠지만.
